<?php
/*******************************************************************************\
    ______  _                                    ____ _____  _  ____  ______
    | ___ \| |                                  / _  | ___ \| |/ __ \/ ____/
    | |  \ \ |          Dmitry Lebedev         / /_| | |  \ \ | /  \ \____ \
    | |__/ / |____      <dl@adios.ru>         / ___  | |__/ / | \__/ /___/ /
    |_____/|_____/                           /_/   |_|_____/|_|\____/_____/

    ------------------------------------------------------------------------

    class dl\tt\Code

    ------------------------------------------------------------------------

    PHP 8.1                                                         (C) 2022

\******************************************************************************/
declare(strict_types=1);
namespace dl\tt;

enum Code: int implements \dl\ErrorCodifier {
	// VALUE RANGE 100 - 149
	case Make      = 100; // Ошибка создания объекта шаблона
	case Open      = 101; // Ошибка открытия объекта шаблона
	case Type      = 102; // Неверный тип компонента
	case Component = 103; // Дочерний компонент отсутствует
	case File      = 104; // Файл корневого шаблона не существует

	public function isFatal(): bool {
		return false;
	}
}
